# Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно.
# Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.

START_SYMBOL = 32
FINAL_SYMBOL = 127
i = 1

for s in range(START_SYMBOL, FINAL_SYMBOL + 1):
    print(f'{s}-"{chr(s)}" ', end='')
    if i == 10:
        print('\n')
        i = 0
    i += 1
