# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

let = int(input('Введите номер буквы в алфавите (1 - 26): '))

let = chr(let + 96)

print(f'ВЫ ввели номер буквы {let}')
