# Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

x = int(input("Введите целое трехзначное число: "))

a = abs(x) // 100
b = (abs(x) - a * 100) // 10
c = abs(x) - a * 100 - b * 10
if x < 0:
    a = -a
sum_of_num = a + b + c
prod_of_num = a * b * c

print(f'Сумма цифр {sum_of_num} \nПроизведение цифр: {prod_of_num}')
